In [1]:
import pandas as pd

In [2]:
data_frame = pd.read_csv('data/friend_list.csv')

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [6]:
type(data_frame.name)

pandas.core.series.Series

In [12]:
# series 는 list로 만듦
s1 = pd.core.series.Series([1,2,3])

In [13]:
s2 = pd.core.series.Series(['one','two','three'])

In [14]:
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

In [17]:
df = pd.read_csv('data/friend_list.csv')

In [19]:
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [20]:
df = pd.read_csv('data/friend_list.txt')

In [21]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [25]:
df = pd.read_csv('data/friend_list_tab.txt')

In [26]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [27]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter='\t')

In [28]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [29]:
df = pd.read_csv('data/friend_list_no_head.csv')

In [30]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [31]:
#header 없을떄
df = pd.read_csv('data/friend_list_no_head.csv', header=None)

In [32]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [33]:
df.columns = ['name','age','job']

In [34]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [36]:
df = pd.read_csv('data/friend_list_no_head.csv', header=None, names=['name','age','job'])

In [37]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## dict to csv

In [39]:
friend_dict_list = [
    {'name':'john', 'age':25, 'job':'student'},
    {'name':'nate', 'age':32, 'job':'teacher'}
]

In [40]:
df = pd.DataFrame(friend_dict_list)

In [42]:
df #순서 보장 x

   name  age      job
0  john   25  student
1  nate   32  teacher

In [43]:
df = df[['name','age','job']]

In [44]:
df

   name  age      job
0  john   25  student
1  nate   32  teacher

## ordereddict to csv

In [46]:
from collections import OrderedDict  #key 순서 보장

In [47]:
friend_ordered_list = OrderedDict(
    [
        ('name',['jogn', 'nate']),
        ('age',[25, 30]),
        ('job',['student', 'teacher'])
    ]
)

In [48]:
df = pd.DataFrame.from_dict(friend_ordered_list)

In [49]:
df

   name  age      job
0  jogn   25  student
1  nate   30  teacher

## list to csv

In [50]:
friend_list = [
    ['jogn',20,'student'],
    ['j',50,'s']
]

In [51]:
column_name = ['name','age','job']

In [52]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [53]:
df

   name  age      job
0  jogn   20  student
1     j   50        s

## null 처리

In [56]:
friends = [
    {'name':'john', 'age':25, 'job':'student'},
    {'name':'nate', 'age':330, 'job':None},
    {'name':'fffff', 'age':32, 'job':'teacher'}
]

df = pd.DataFrame(friends)
df = df[['name','age','job']]

In [57]:
df

    name  age      job
0   john   25  student
1   nate  330     None
2  fffff   32  teacher

In [69]:
df.to_csv('friends.csv', index=True, header=True, na_rep='-')
#default : index=True, header=True 
#na_rep : 빈칸은 -로 바뀜

In [70]:
df.isnull().sum()

name    0
age     0
job     1
dtype: int64

In [71]:
df

    name  age      job
0   john   25  student
1   nate  330     None
2  fffff   32  teacher

## 행 값만 가져옴

In [75]:
friends = [
    {'name':'john', 'age':25, 'job':'student'},
    {'name':'nate', 'age':330, 'job':'develoer'},
    {'name':'fffff', 'age':32, 'job':'teacher'}
]

df = pd.DataFrame(friends)
df = df[['name','age','job']]

In [76]:
df

    name  age       job
0   john   25   student
1   nate  330  develoer
2  fffff   32   teacher

In [77]:
df[1:3]

    name  age       job
1   nate  330  develoer
2  fffff   32   teacher

In [78]:
df = df[1:3]

In [79]:
df

    name  age       job
1   nate  330  develoer
2  fffff   32   teacher

In [80]:
friends = [
    {'name':'john', 'age':25, 'job':'student'},
    {'name':'nate', 'age':330, 'job':'develoer'},
    {'name':'fffff', 'age':32, 'job':'teacher'}
]

df = pd.DataFrame(friends)
df = df[['name','age','job']]

In [81]:
df.loc[[0,2]]

    name  age      job
0   john   25  student
2  fffff   32  teacher

by column condition

In [82]:
df[df.age>25]

    name  age       job
1   nate  330  develoer
2  fffff   32   teacher

In [86]:
df[(df.age>25) & (df.name == 'nate')]

   name  age       job
1  nate  330  develoer

## filter column

### by index

In [91]:
friend_list = [
    ['jogn',20,'student'],
    ['jssss',50,'s'],
    ['nate',50,'teacger']
]
df = pd.DataFrame.from_records(friend_list)

In [92]:
df

       0   1        2
0   jogn  20  student
1  jssss  50        s
2   nate  50  teacger

In [93]:
df.iloc[:, 0:2]

       0   1
0   jogn  20
1  jssss  50
2   nate  50

In [94]:
df.iloc[0:2, 0:2]

       0   1
0   jogn  20
1  jssss  50

## by column name

In [118]:
df = pd.read_csv('data/friend_list_no_head.csv', header=None, 
                names = ['name', 'age', 'job'])

In [119]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [98]:
df_filter = df[['name','age']]

In [101]:
df_filter

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [103]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [106]:
#header에 a들어간거만 출력
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [108]:
#정규식
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [120]:
df.drop([0])  #df.drop(['Nate', 'chris'])도 가능

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [121]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [122]:
df.drop([0], inplace=True)  #따로 assign 안해도됨 
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [132]:
friends = [
    {'name':'john', 'age':25, 'job':'student'},
    {'name':'nate', 'age':330, 'job':'develoer'},
    {'name':'fffff', 'age':32, 'job':'teacher'}
]

df = pd.DataFrame(friends)

In [124]:
df

    name  age       job
0   john   25   student
1   nate  330  develoer
2  fffff   32   teacher

In [125]:
df = df.drop(df.index[[0,2]])

In [126]:
df

   name  age       job
1  nate  330  develoer

In [133]:
df = df.drop('age', axis=1) #col 중에서 age 삭제

In [135]:
df

    name       job
0   john   student
1   nate  develoer
2  fffff   teacher

In [137]:
df.drop('job', axis=1, inplace=True)

In [138]:
df

    name
0   john
1   nate
2  fffff